In [170]:
import numpy as np
print("NumPy version:", np.__version__)

import pandas as pd
print("Pandas version:", pd.__version__)

NumPy version: 2.2.6
Pandas version: 2.3.3

Create Pandas Series

In [171]:
series = pd.Series([1, 3, 5, np.nan, 6, 8])
print(series)

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

DataFrames

In [172]:
myDict = {'Name': ["Mustafa" , "One1" , "One2"], 'Age': [2, None, 4], 'City': ["Cairo", "Newyork", "Los Angeles"]}

df = pd.DataFrame(myDict)
df

      Name  Age         City
0  Mustafa  2.0        Cairo
1     One1  NaN      Newyork
2     One2  4.0  Los Angeles

In [173]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     2 non-null      float64
 2   City    3 non-null      object
dtypes: float64(1), object(2)
memory usage: 200.0+ bytes

In [174]:
df.describe().transpose()

     count  mean       std  min  25%  50%  75%  max
Age    2.0   3.0  1.414214  2.0  2.5  3.0  3.5  4.0

In [175]:
df[['Name', 'Age']]

      Name  Age
0  Mustafa  2.0
1     One1  NaN
2     One2  4.0

In [176]:
df.loc[0 , ['Name', 'City']]

Name    Mustafa
City      Cairo
Name: 0, dtype: object

In [177]:
df["Salary"] = [5000, 6000, 7000]
df["Age"] = df["Age"]+1
print(df)

      Name  Age         City  Salary
0  Mustafa  3.0        Cairo    5000
1     One1  NaN      Newyork    6000
2     One2  5.0  Los Angeles    7000

In [178]:
# df.drop(1 , axis=0 , inplace=True) #Rows 0 Columns 1
df.reset_index(inplace=True)
df.isnull().sum()
# df["Age"].fillna(df["Age"].mean(), inplace=True) #to fill missing values
df.dropna(inplace=True)
df

   index     Name  Age         City  Salary
0      0  Mustafa  3.0        Cairo    5000
2      2     One2  5.0  Los Angeles    7000